golang/reading/goroutine/goroutine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-23 六 01:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>go并发之道</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry https://github.com/rzry" />
<link rel='stylesheet' type='text/css' href='http://zxxky.cn/1.css'/>
</head>
<body>
<div id="content">
<h1 class="title">go并发之道</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1e8aaa1">1. <span class="todo TODO">TODO</span> note</a></li>
<li><a href="#org423c965">2. <span class="done DONE">DONE</span> part 1</a></li>
<li><a href="#org4fc80c1">3. <span class="done DONE">DONE</span> part 2</a></li>
<li><a href="#orgd880baf">4. <span class="todo TODO">TODO</span> part 3</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1e8aaa1" class="outline-2">
<h2 id="org1e8aaa1"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> note</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
最好不要让goroutine 异步调用
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">func</span> <span style="color: #44b9b1;">Server</span>(){
        <span style="color: #51afef;">go</span> <span style="color: #51afef;">func</span>(){
                <span style="color: #51afef;">println</span>()
        }()

}

<span style="color: #51afef;">func</span> <span style="color: #44b9b1;">Server</span>(){
        println
}

<span style="color: #51afef;">go</span> <span style="color: #44b9b1;">Server</span>()
</pre>
</div></li>
<li><p>
使用chan 来控制你创建的goroutine
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">func</span> <span style="color: #44b9b1;">init</span>(){

 }

 <span style="color: #51afef;">func</span> <span style="color: #44b9b1;">main</span>(){
         <span style="color: #979797;">done</span> := <span style="color: #51afef;">make</span>(<span style="color: #51afef;">chan</span> <span style="color: #44b9b1;">error</span>,2)
         <span style="color: #979797;">stop</span> := <span style="color: #51afef;">make</span>(<span style="color: #51afef;">chan</span> <span style="color: #51afef;">struct</span>{},0)

         <span style="color: #51afef;">go</span> <span style="color: #51afef;">func</span>(){

         }()
 }

 <span style="color: #51afef;">func</span> <span style="color: #44b9b1;">debug</span>(){
 }

 <span style="color: #51afef;">func</span> <span style="color: #44b9b1;">handler</span>(){

 }

 <span style="color: #51afef;">func</span> <span style="color: #44b9b1;">service</span>(){

 }
</pre>
</div></li>
</ul>
</div>
</div>
