golang/reading/goroutine/goroutine.html

<div id="outline-container-org423c965" class="outline-2">
<h2 id="org423c965"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> part 1</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
竞争条件
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #747474;">// </span><span style="color: #747474;">TestA ...</span>
<span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestA</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>)  {
        <span style="color: #51afef;">var</span> <span style="color: #979797;">data</span> <span style="color: #44b9b1;">int</span>
        <span style="color: #51afef;">go</span> <span style="color: #51afef;">func</span>(){data++}()

        <span style="color: #51afef;">if</span> data == <span style="color: #44b9b1;">0</span>{
                t.<span style="color: #44b9b1;">Log</span>(<span style="color: #99bb66;">"this value is "</span>,data)
        }
}
<span style="color: #747474;">//</span><span style="color: #747474;">1 . &#20160;&#20040;&#37117;&#19981;&#25171;&#21360; data++ &#22312;if &#21069;</span>
<span style="color: #747474;">//</span><span style="color: #747474;">2 . &#25171;&#21360;0 if  &#22312;data++ &#20043;&#21069;&#25191;&#34892;</span>
<span style="color: #747474;">//</span><span style="color: #747474;">3 . &#25171;&#21360;1 data++&#22312;if&#20043;&#21518;&#25191;&#34892; &#20294;&#26159;log&#22312;data++&#21518;&#25191;&#34892;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#21738;&#24597;&#22312;if &#21069;&#21152;sleep &#20063;&#21482;&#26159;&#38477;&#20302;&#20102;&#36825;&#31181;&#21487;&#33021;&#24615;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#24182;&#19981;&#20250;&#26159;&#19968;&#20010;&#20581;&#24247;&#30340;&#31243;&#24207;</span>
</pre>
</div></li>
<li><p>
内存访问同步
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #747474;">// </span><span style="color: #747474;">TestA ...</span>
<span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestA</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>)  {
        <span style="color: #51afef;">var</span> <span style="color: #979797;">data</span> <span style="color: #44b9b1;">int</span>
        <span style="color: #51afef;">go</span> <span style="color: #51afef;">func</span>(){data++}()
        <span style="color: #51afef;">if</span> data == <span style="color: #44b9b1;">0</span>{
                t.<span style="color: #44b9b1;">Log</span>(<span style="color: #99bb66;">"this value is "</span>,data)
        }<span style="color: #51afef;">else</span>{
                t.<span style="color: #44b9b1;">Log</span>(<span style="color: #99bb66;">"this value is "</span>,data)
        }
}
<span style="color: #747474;">// </span><span style="color: #747474;">data &#31639;&#26159; &#20849;&#20139;&#36164;&#28304; . &#23545;&#19978;&#36848;&#20363;&#23376;&#26377;&#19977;&#20010;&#20020;&#30028;&#21306;</span>
<span style="color: #747474;">//</span><span style="color: #747474;">&#20020;&#30028;&#21306;&#26159;&#38656;&#35201;&#29420;&#21344;&#35775;&#38382;&#20849;&#20139;&#36164;&#28304;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">1 . goroutine &#22312;&#35753;data++</span>
<span style="color: #747474;">// </span><span style="color: #747474;">2 . if &#22312;&#26816;&#26597;data &#26159;&#21542;&#20026;0</span>
<span style="color: #747474;">// </span><span style="color: #747474;">3 . t.log &#27491;&#22312;&#26816;&#32034;&#24182;&#25171;&#21360;data &#30340;&#20540;</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestA</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>)  {
        <span style="color: #51afef;">var</span> <span style="color: #979797;">memoryAccess</span> <span style="color: #44b9b1;">sync.Mutex</span>
        <span style="color: #51afef;">var</span> <span style="color: #979797;">value</span> <span style="color: #44b9b1;">int</span>
        <span style="color: #51afef;">go</span> <span style="color: #51afef;">func</span> (){
                memoryAccess.<span style="color: #44b9b1;">Lock</span>()
                value++
                memoryAccess.<span style="color: #44b9b1;">Unlock</span>()
        }()

        memoryAccess.<span style="color: #44b9b1;">Lock</span>()
        <span style="color: #51afef;">if</span> value == <span style="color: #44b9b1;">0</span>{
                t.<span style="color: #44b9b1;">Log</span>(<span style="color: #99bb66;">"this value is "</span>,value)
        }<span style="color: #51afef;">else</span>{
                t.<span style="color: #44b9b1;">Log</span>(<span style="color: #99bb66;">"this value is "</span>,value)
        }
        memory.Access.<span style="color: #44b9b1;">Unlock</span>()

}
<span style="color: #747474;">//</span><span style="color: #747474;">...&#34429;&#28982;&#24182;&#19981;&#20250;&#36825;&#26679;&#20570;,&#20294;&#26159;&#36825;&#21487;&#20197;&#31616;&#21333;&#28436;&#31034;&#20869;&#23384;&#35775;&#38382;&#21516;&#27493;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#22768;&#26126;&#19968;&#20010;&#38145; , &#30452;&#21040;&#38145;&#21462;&#28040;&#21069; goroutine &#24212;&#35813;&#29420;&#21344;&#20869;&#23384;&#30340;&#35775;&#38382;&#26435;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">unlock &#23459;&#24067;goroutine&#20351;&#29992;&#23436;&#36825;&#27573;&#20869;&#23384;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#20877;&#22768;&#26126;&#19979;&#38754;&#30340; &#21028;&#26029;&#35821;&#21477;,&#35753;&#23427;&#29420;&#21344;data&#20869;&#23384;&#30340;&#35775;&#38382;&#26435;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#34429;&#28982;&#36825;&#26679;&#35299;&#20915;&#20102;&#25968;&#25454;&#31454;&#20105;,&#20294;&#26159;&#24182;&#27809;&#26377;&#23427;&#30340;&#25805;&#20316;&#39034;&#24207;&#26159;&#19981;&#30830;&#23450;&#30340;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#19978;&#36848;&#20195;&#30721;,goroutine&#21917;if/else &#37117;&#20250;&#26377;&#21487;&#33021;&#20808;&#25191;&#34892;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#24182;&#19988;&#19978;&#36848;&#21152;&#38145;&#20250;&#26377;&#24615;&#33021;&#38382;&#39064;,lock &#20250;&#35753;&#25105;&#20204;&#31243;&#24207;&#21464;&#24930;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">--ques</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#20020;&#30028;&#21306;&#26159;&#21542;&#39057;&#32321;&#20986;&#20837;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#20020;&#30028;&#21306;&#35813;&#26377;&#22810;&#22823; .. context</span>
</pre>
</div></li>

<li><p>
死锁
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">type</span> <span style="color: #44b9b1;">Value</span> <span style="color: #51afef;">struct</span> {
        mu <span style="color: #44b9b1;">sync.Mutex</span>
        value <span style="color: #44b9b1;">int</span>
}

<span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestA</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>){
        <span style="color: #51afef;">var</span> <span style="color: #979797;">wg</span> <span style="color: #44b9b1;">sync.WaitGroup</span>

        <span style="color: #979797;">printSum</span> := <span style="color: #51afef;">func</span>(<span style="color: #979797;">v1</span>,<span style="color: #979797;">v2</span> *<span style="color: #44b9b1;">Value</span>){
                <span style="color: #51afef;">defer</span> wg.<span style="color: #44b9b1;">Done</span>()

                v1.mu.<span style="color: #44b9b1;">Lock</span>()
                <span style="color: #51afef;">defer</span> v1.mu.<span style="color: #44b9b1;">Unlock</span>()

                time.<span style="color: #44b9b1;">Sleep</span>(2*time.Second)
                v2.mu.<span style="color: #44b9b1;">Lock</span>()
                <span style="color: #51afef;">defer</span> v2.mu.<span style="color: #44b9b1;">Unlock</span>()
                t.<span style="color: #44b9b1;">Logf</span>(<span style="color: #99bb66;">"sum = %v"</span>,v1.value+v2.value)
        }
        <span style="color: #51afef;">var</span> <span style="color: #979797;">a</span> ,b <span style="color: #44b9b1;">Value</span>
        wg.<span style="color: #44b9b1;">Add</span>(2)
        <span style="color: #51afef;">go</span> <span style="color: #44b9b1;">printSum</span>(&amp;a,&amp;b)
        <span style="color: #51afef;">go</span> <span style="color: #44b9b1;">printSum</span>(&amp;b,&amp;a)
        wg.<span style="color: #44b9b1;">Wait</span>()
}
<span style="color: #747474;">// </span><span style="color: #747474;">&#31532;&#19968;&#20010; go &#35843;&#29992; &#20989;&#25968; &#38145;&#23450;a &#28982;&#21518;&#31561;&#24453;2s &#20934;&#22791;&#38145;&#23450;b</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#31532;&#20108;&#20010; go &#24320;&#22987;&#38145;&#23450;b &#28982;&#21518;&#22312;&#35797;&#30528;&#38145;&#23450; a</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#20004;&#27493;&#21516;&#26102;&#36827;&#34892;,&#26080;&#38480;&#31561;&#24453;</span>
</pre>
</div></li>
<li><p>
活锁
</p>
<div class="org-src-container">
<pre class="src src-go">
</pre>
</div></li>
<li><p>
饥饿
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestGo</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>){
        <span style="color: #51afef;">var</span> <span style="color: #979797;">wg</span> <span style="color: #44b9b1;">sync.WaitGroup</span>
        <span style="color: #51afef;">var</span> <span style="color: #979797;">sharedLock</span> <span style="color: #44b9b1;">sync.Mutex</span>
        <span style="color: #51afef;">const</span> <span style="color: #51afef;">runtime</span> = 1*time.Second

        <span style="color: #979797;">greedyWorker</span> := <span style="color: #51afef;">func</span>(){
                <span style="color: #51afef;">defer</span> wg.<span style="color: #44b9b1;">Done</span>()
                <span style="color: #51afef;">var</span> <span style="color: #979797;">count</span> <span style="color: #44b9b1;">int</span>
                <span style="color: #51afef;">for</span> <span style="color: #979797;">begin</span> := time.<span style="color: #44b9b1;">Now</span>();time.<span style="color: #44b9b1;">Since</span>(begin) &lt;= runtime;{
                        sharedLock.<span style="color: #44b9b1;">Lock</span>()
                        time.<span style="color: #44b9b1;">Sleep</span>(3*time.Nanosecond)
                        sharedLock.<span style="color: #44b9b1;">Unlock</span>()
                        count++
                }
                t.<span style="color: #44b9b1;">Logf</span>(<span style="color: #99bb66;">"&#36138;&#24515;work execute %v"</span>,count)
        }

        <span style="color: #979797;">politeWorker</span> := <span style="color: #51afef;">func</span>(){
                <span style="color: #51afef;">defer</span> wg.<span style="color: #44b9b1;">Done</span>()
                <span style="color: #51afef;">var</span> <span style="color: #979797;">count</span> <span style="color: #44b9b1;">int</span>
                <span style="color: #51afef;">for</span> <span style="color: #979797;">begin</span> := time.<span style="color: #44b9b1;">Now</span>();time.<span style="color: #44b9b1;">Since</span>(begin)&lt;= runtime;{

                        sharedLock.<span style="color: #44b9b1;">Lock</span>()
                        time.<span style="color: #44b9b1;">Sleep</span>(1*time.Nanosecond)
                        sharedLock.<span style="color: #44b9b1;">Unlock</span>()

                        sharedLock.<span style="color: #44b9b1;">Lock</span>()
                        time.<span style="color: #44b9b1;">Sleep</span>(1*time.Nanosecond)
                        sharedLock.<span style="color: #44b9b1;">Unlock</span>()

                        sharedLock.<span style="color: #44b9b1;">Lock</span>()
                        time.<span style="color: #44b9b1;">Sleep</span>(1*time.Nanosecond)
                        sharedLock.<span style="color: #44b9b1;">Unlock</span>()

                        count++
                }
                t.<span style="color: #44b9b1;">Logf</span>(<span style="color: #99bb66;">"&#24179;&#21644; work execute %v"</span>,count)
        }

        wg.<span style="color: #44b9b1;">Add</span>(2)
        <span style="color: #51afef;">go</span> <span style="color: #44b9b1;">greedyWorker</span>()
        <span style="color: #51afef;">go</span> <span style="color: #44b9b1;">politeWorker</span>()
        wg.<span style="color: #44b9b1;">Wait</span>()
}
<span style="color: #747474;">// </span><span style="color: #747474;">&#36138;&#23146;&#30340; count &#20540;&#22823; </span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#20004;&#20010;&#31243;&#24207; &#20849;&#20139;&#38145;, &#36138;&#23146;&#30340;work &#20250;&#36138;&#23146;&#30340;&#25250;&#21344;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#24179;&#21644;&#30340;worker &#21482;&#20250;&#22312;&#38656;&#35201;&#26102;&#38145;&#23450;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#20004;&#20010;&#20154;&#24037;&#20316;&#21516;&#26679;&#30340;&#24037;&#20316;,&#21516;&#26679;&#30340;&#26102;&#38388;,&#36138;&#23146;&#30340;&#24037;&#20316;&#37327;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#26159;&#24179;&#21644;&#30340;work &#30340;&#20004;&#20493;</span>
<span style="color: #747474;">// </span><span style="color: #747474;">&#19981;&#30693;&#36947;&#21487;&#19981;&#21487;&#20197;&#29702;&#35299;&#20026; &#27599;&#27425;&#21152;&#38145;&#36234;&#22810; &#23601;&#20250;&#36234;&#24930; &#35201;&#31561;&#24453;&#21035;&#20154;&#37322;&#25918;</span>
</pre>
</div></li>
</ul>
</div>
</div>
