golang/reading/goroutine/goroutine.org
* DONE part 2 
  CLOSED: [2021-01-22 五 01:30]
  - 并发or并行
    #+begin_src 
    1 . 并发属于代码,并行属于程序
    2 . csp 如果在 sync 和 channel 作出选择
      - 传递数据所有权(类似生产消费)-->带缓存的channel来做
      - 保护结构的内部状态,想要内部数据线程安全--> sync 
      - 协调多个逻辑片段--> select,channel 
        因为channel本质上比内存访问同步原语更具有组合性
      - 性能...
    3 . 追求简洁.尽量使用channel 并且认为goroutine没有成本
    #+end_src
* TODO part 3
  - goroutine 
    #+begin_src 
    1 . go中的goroutine是独一无二的
    2 . 不是os线程,也不是绿色线程(语言运行时管理的线程)
    3 . 它们是协程(非抢占式,简单并发子goroutine(函数,闭包,方法))
    4 . 他们可以在被阻塞时挂起,不阻塞时恢复.某种程度它们又称为可抢占的
    5 . 协程和goroutine都是隐式并发结构,但是并发不是协程的属性
        必须同时托管多个协程,并给每个协程一个可以执行的机会,
        否则他们就不会并发,(但是go 协程并不是隐式并行的)
    #+end_src
  - go的主机托管机制
    #+begin_src 
    1 . 主机托管机制是,M:N 调度器实现的,M个绿色线程映射到N个OS线程
        然后将goroutine运行在绿色线程.
    2 . 当goroutine数量超过可用绿色线程的时候
        调度程序将处理分布在可用线程上的goroutine
        并且确保当这些goroutine被阻塞时,其他的goroutine可以运行      
    #+end_src
  - join point 
    #+begin_src go
      func TestGg(t *testing.T){
              var wg sync.WaitGroup

              sayHi := func() {
                      defer wg.Done()
                      t.Log("hello world")
              }
              wg.Add(1)
              go sayHi()
              wg.Wait()
      }
      //如上文,我们使用许多的匿名函数
      //来创建goroutine , 如果我们在goroutine
      //运行一个闭包,那么闭包是在变量的副本运行很是在原值
      //的引用上运行?
    #+end_src
    #+begin_src go
    func TestGg(t *testing.T){
	var wg sync.WaitGroup

	sayHi := func() {
		defer wg.Done()
		t.Log("hello world")
	}
	wg.Add(1)
	go sayHi()
	wg.Wait()
    }
    //这个goroutine会修改值,
    //证明go 在 他们所创建的相同地址空间内执行
    #+end_src
    #+begin_src go
    func TestGg(t *testing.T){
	var wg sync.WaitGroup

	for _,v := range []string{"hello","world","rzry","goroutine"}{
		wg.Add(1)
		go func() {
			defer wg.Done()
			t.Log(v)
		}()
	}
	wg.Wait()
    }
    //输出了4个goroutine 
    //go 运行了一个闭包,在闭包使用v 的时候,字符串迭代已经结束了
    //计划中的goroutine可能在未来的任何时间点运行,他不确定
    //在goroutine中会打印什么值..
    //编写这个正确的做法是 把 v 的副本传递到闭包中 
    func (v string){}(v)  
    //而 func (string){}(v)都是不会成功的
    #+end_src
    - 56 - 59 讲述了goroutine和上下文切换的大小和时长
    - sync.waitgroup
      #+begin_src 
      可以把waitgroup是做一个并发安全的计数器
      上文所述,goroutine无法判断神码时候运行
      我们可以在go 前执行 wg.wait 
      如果将调用的Add方法添加到goroutine的闭包中
      那么wait可能会直接返回,因为add并不会运行
      我们通常只调用一组goroutine来追踪一组goroutine
      #+end_src
      #+begin_src go
      func TestGg(t *testing.T){
	var wg sync.WaitGroup

	for _,v := range []string{"hello","world","rzry","goroutine"}{
		wg.Add(1)
		go func() {
			defer wg.Done()
			t.Log(v)
		}()
	}
	wg.Wait()
      }
      #+end_src
-----
下接 page 60 互斥,读写
