golang/reading/goroutine/goroutine.html
<div id="outline-container-org4fc80c1" class="outline-2">
<h2 id="org4fc80c1"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> part 2</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><p>
并发or并行
</p>
<pre class="example">
1 . 并发属于代码,并行属于程序
2 . csp 如果在 sync 和 channel 作出选择
  - 传递数据所有权(类似生产消费)--&gt;带缓存的channel来做
  - 保护结构的内部状态,想要内部数据线程安全--&gt; sync 
  - 协调多个逻辑片段--&gt; select,channel 
    因为channel本质上比内存访问同步原语更具有组合性
  - 性能...
3 . 追求简洁.尽量使用channel 并且认为goroutine没有成本
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgd880baf" class="outline-2">
<h2 id="orgd880baf"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> part 3</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><p>
goroutine 
</p>
<pre class="example">
1 . go中的goroutine是独一无二的
2 . 不是os线程,也不是绿色线程(语言运行时管理的线程)
3 . 它们是协程(非抢占式,简单并发子goroutine(函数,闭包,方法))
4 . 他们可以在被阻塞时挂起,不阻塞时恢复.某种程度它们又称为可抢占的
5 . 协程和goroutine都是隐式并发结构,但是并发不是协程的属性
    必须同时托管多个协程,并给每个协程一个可以执行的机会,
    否则他们就不会并发,(但是go 协程并不是隐式并行的)
</pre></li>
<li><p>
go的主机托管机制
</p>
<pre class="example">
1 . 主机托管机制是,M:N 调度器实现的,M个绿色线程映射到N个OS线程
    然后将goroutine运行在绿色线程.
2 . 当goroutine数量超过可用绿色线程的时候
    调度程序将处理分布在可用线程上的goroutine
    并且确保当这些goroutine被阻塞时,其他的goroutine可以运行      
</pre></li>
<li><p>
join point 
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestGg</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>){
        <span style="color: #51afef;">var</span> <span style="color: #979797;">wg</span> <span style="color: #44b9b1;">sync.WaitGroup</span>

        <span style="color: #979797;">sayHi</span> := <span style="color: #51afef;">func</span>() {
                <span style="color: #51afef;">defer</span> wg.<span style="color: #44b9b1;">Done</span>()
                t.<span style="color: #44b9b1;">Log</span>(<span style="color: #99bb66;">"hello world"</span>)
        }
        wg.<span style="color: #44b9b1;">Add</span>(1)
        <span style="color: #51afef;">go</span> <span style="color: #44b9b1;">sayHi</span>()
        wg.<span style="color: #44b9b1;">Wait</span>()
}
<span style="color: #747474;">//</span><span style="color: #747474;">&#22914;&#19978;&#25991;,&#25105;&#20204;&#20351;&#29992;&#35768;&#22810;&#30340;&#21311;&#21517;&#20989;&#25968;</span>
<span style="color: #747474;">//</span><span style="color: #747474;">&#26469;&#21019;&#24314;goroutine , &#22914;&#26524;&#25105;&#20204;&#22312;goroutine</span>
<span style="color: #747474;">//</span><span style="color: #747474;">&#36816;&#34892;&#19968;&#20010;&#38381;&#21253;,&#37027;&#20040;&#38381;&#21253;&#26159;&#22312;&#21464;&#37327;&#30340;&#21103;&#26412;&#36816;&#34892;&#24456;&#26159;&#22312;&#21407;&#20540;</span>
<span style="color: #747474;">//</span><span style="color: #747474;">&#30340;&#24341;&#29992;&#19978;&#36816;&#34892;?</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestGg</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>){
    <span style="color: #51afef;">var</span> <span style="color: #979797;">wg</span> <span style="color: #44b9b1;">sync.WaitGroup</span>

    <span style="color: #979797;">sayHi</span> := <span style="color: #51afef;">func</span>() {
            <span style="color: #51afef;">defer</span> wg.<span style="color: #44b9b1;">Done</span>()
            t.<span style="color: #44b9b1;">Log</span>(<span style="color: #99bb66;">"hello world"</span>)
    }
    wg.<span style="color: #44b9b1;">Add</span>(1)
    <span style="color: #51afef;">go</span> <span style="color: #44b9b1;">sayHi</span>()
    wg.<span style="color: #44b9b1;">Wait</span>()
}
<span style="color: #747474;">//</span><span style="color: #747474;">&#36825;&#20010;goroutine&#20250;&#20462;&#25913;&#20540;,</span>
<span style="color: #747474;">//</span><span style="color: #747474;">&#35777;&#26126;go &#22312; &#20182;&#20204;&#25152;&#21019;&#24314;&#30340;&#30456;&#21516;&#22320;&#22336;&#31354;&#38388;&#20869;&#25191;&#34892;</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestGg</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>){
    <span style="color: #51afef;">var</span> <span style="color: #979797;">wg</span> <span style="color: #44b9b1;">sync.WaitGroup</span>

    <span style="color: #51afef;">for</span> <span style="color: #979797;">_</span>,v := <span style="color: #51afef;">range</span> []<span style="color: #44b9b1;">string</span>{<span style="color: #99bb66;">"hello"</span>,<span style="color: #99bb66;">"world"</span>,<span style="color: #99bb66;">"rzry"</span>,<span style="color: #99bb66;">"goroutine"</span>}{
            wg.<span style="color: #44b9b1;">Add</span>(1)
            <span style="color: #51afef;">go</span> <span style="color: #51afef;">func</span>() {
                    <span style="color: #51afef;">defer</span> wg.<span style="color: #44b9b1;">Done</span>()
                    t.<span style="color: #44b9b1;">Log</span>(v)
            }()
    }
    wg.<span style="color: #44b9b1;">Wait</span>()
}
<span style="color: #747474;">//</span><span style="color: #747474;">&#36755;&#20986;&#20102;4&#20010;goroutine </span>
<span style="color: #747474;">//</span><span style="color: #747474;">go &#36816;&#34892;&#20102;&#19968;&#20010;&#38381;&#21253;,&#22312;&#38381;&#21253;&#20351;&#29992;v &#30340;&#26102;&#20505;,&#23383;&#31526;&#20018;&#36845;&#20195;&#24050;&#32463;&#32467;&#26463;&#20102;</span>
<span style="color: #747474;">//</span><span style="color: #747474;">&#35745;&#21010;&#20013;&#30340;goroutine&#21487;&#33021;&#22312;&#26410;&#26469;&#30340;&#20219;&#20309;&#26102;&#38388;&#28857;&#36816;&#34892;,&#20182;&#19981;&#30830;&#23450;</span>
<span style="color: #747474;">//</span><span style="color: #747474;">&#22312;goroutine&#20013;&#20250;&#25171;&#21360;&#20160;&#20040;&#20540;..</span>
<span style="color: #747474;">//</span><span style="color: #747474;">&#32534;&#20889;&#36825;&#20010;&#27491;&#30830;&#30340;&#20570;&#27861;&#26159; &#25226; v &#30340;&#21103;&#26412;&#20256;&#36882;&#21040;&#38381;&#21253;&#20013; </span>
<span style="color: #51afef;">func</span> (<span style="color: #979797;">v</span> <span style="color: #44b9b1;">string</span>){}(v)  
<span style="color: #747474;">//</span><span style="color: #747474;">&#32780; func (string){}(v)&#37117;&#26159;&#19981;&#20250;&#25104;&#21151;&#30340;</span>
</pre>
</div>
<ul class="org-ul">
<li>56 - 59 讲述了goroutine和上下文切换的大小和时长</li>
<li><p>
sync.waitgroup
</p>
<pre class="example">
可以把waitgroup是做一个并发安全的计数器
上文所述,goroutine无法判断神码时候运行
我们可以在go 前执行 wg.wait 
如果将调用的Add方法添加到goroutine的闭包中
那么wait可能会直接返回,因为add并不会运行
我们通常只调用一组goroutine来追踪一组goroutine
</pre>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">func</span> <span style="color: #44b9b1;">TestGg</span>(<span style="color: #979797;">t</span> *<span style="color: #44b9b1;">testing.T</span>){
  <span style="color: #51afef;">var</span> <span style="color: #979797;">wg</span> <span style="color: #44b9b1;">sync.WaitGroup</span>

  <span style="color: #51afef;">for</span> <span style="color: #979797;">_</span>,v := <span style="color: #51afef;">range</span> []<span style="color: #44b9b1;">string</span>{<span style="color: #99bb66;">"hello"</span>,<span style="color: #99bb66;">"world"</span>,<span style="color: #99bb66;">"rzry"</span>,<span style="color: #99bb66;">"goroutine"</span>}{
          wg.<span style="color: #44b9b1;">Add</span>(1)
          <span style="color: #51afef;">go</span> <span style="color: #51afef;">func</span>() {
                  <span style="color: #51afef;">defer</span> wg.<span style="color: #44b9b1;">Done</span>()
                  t.<span style="color: #44b9b1;">Log</span>(v)
          }()
  }
  wg.<span style="color: #44b9b1;">Wait</span>()
}
</pre>
</div></li>
</ul></li>
</ul>
<hr />
<p>
下接 page 60 互斥,读写
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-01-12</p>
<p class="author">Author: rzry <a href="https://github.com/rzry">https://github.com/rzry</a></p>
<p class="date">Created: 2021-01-23 六 01:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
